//
//  ViewController.m
//  EmojiString
//
//  Created by GabrielMassana on 07/01/2016.
//  Copyright © 2016 GabrielMassana. All rights reserved.
//

#import "EMOViewController.h"

#import "NSString+EMOEmoji.h"

@interface EMOViewController ()

@end

@implementation EMOViewController

- (void)viewDidLoad
{
    [super viewDidLoad];

    NSString *ios91 = @"🙂🤗🤔🙄🤐🤓☹🙁🙃🤒🤕🤑⛑🕵🗣🤘🖕🖐✍👁🕶🦁🦄🐿🦃🕊🦀🕷🕸🦂☘🌡⛈🌤🌥🌦🌧🌨🌩🌪🌫🌬☄☂️⛱🏖🌶🧀🌭🌮🌯🍿🍾🍽🏌⛸⛷⛹🏋🏎🏍🏅🏏🏐🏑🏒🏓🏸🗺🏔⛰🏕🏖🏜🏝🏞🏟🏛🏗🏘🏙🏚🕋🕌🕍⛩📿🕎✝️☦✡️☸☪🕉🛐🛣🛤🛳⛴🛥🛩🛫🛬🛰🛢🛎🛌🛏🛋⏱⏲🕰🎖🎗🖼🎞🎟🏷🕹🎙🎚🎛*⃣🖥🖨⌨🖱🖲📽📸🛍🕯🗞🗳🖋🖊🖌🖍🗂🗒🗓🖇🗃🗄🗑🗝⛏⚒🛠⚙🗜⚗⚖⛓🗡⚔🛡🏹⚰⚱🏳🏴🕳⚜⚛☯️☮☢☣⏭⏯⏮⏸⏹⏺🗯👁‍🗨🇦🇫🇦🇱🇩🇿🇦🇸🇦🇩🇦🇴🇦🇮🇦🇬🇦🇷🇦🇲🇦🇼🇦🇿🇧🇸🇧🇭🇧🇩🇧🇧🇧🇾🇧🇿🇧🇯🇧🇲🇧🇹🇧🇴🇧🇦🇧🇼🇻🇬🇧🇳🇧🇬🇧🇫🇧🇮🇰🇭🇨🇲🇨🇻🇰🇾🇨🇫🇹🇩🇰🇲🇨🇬🇨🇩🇨🇰🇨🇷🇨🇮🇭🇷🇨🇺🇨🇼🇨🇾🇨🇿🇩🇯🇩🇲🇩🇴🇪🇨🇪🇬🇸🇻🇬🇶🇪🇷🇪🇪🇪🇹🇫🇴🇫🇯🇬🇫🇹🇫🇬🇦🇬🇲🇬🇪🇬🇭🇬🇮🇬🇷🇬🇱🇬🇩🇬🇺🇬🇹🇬🇬🇬🇳🇬🇼🇬🇾🇭🇹🇭🇳🇭🇺🇮🇸🇮🇷🇮🇶🇯🇲🇯🇴🇰🇿🇰🇪🇰🇮🇽🇰🇰🇼🇰🇬🇱🇦🇱🇻🇱🇧🇱🇸🇱🇷🇱🇾🇱🇮🇱🇹🇱🇺🇲🇰🇲🇬🇲🇼🇲🇻🇲🇱🇲🇹🇲🇷🇾🇹🇲🇩🇲🇳🇲🇪🇲🇸🇲🇦🇲🇿🇲🇲🇳🇦🇳🇵🇳🇨🇳🇮🇳🇪🇳🇬🇳🇺🇲🇵🇰🇵🇴🇲🇵🇰🇵🇼🇵🇸🇵🇦🇵🇬🇵🇾🇵🇪🇶🇦🇷🇴🇷🇼🇼🇸🇸🇲🇸🇹🇸🇳🇷🇸🇸🇨🇸🇱🇸🇽🇸🇰🇸🇮🇸🇧🇸🇴🇸🇸🇱🇰🇰🇳🇱🇨🇲🇫🇵🇲🇻🇨🇸🇩🇸🇷🇸🇿🇸🇾🇹🇯🇹🇿🇹🇭🇹🇱🇹🇬🇹🇴🇹🇹🇹🇳🇹🇲🇹🇨🇹🇻🇺🇬🇺🇦🇺🇾🇻🇮🇺🇿🇻🇺🇻🇪🇾🇪🇿🇲🇿🇼";
    NSString *abc = @"abcdefghijklmnopqrstuvwxyz";
    NSString *weird = @"✍☘☦☸☪⌨⚒⚙⚗⚖⚔⚰⚱⚜⚛☮☢☣";
    NSString *ios91New = @"🤐🤑🤒🤓🤔🤕🤖🤗🤘🦀🦁🦂🦃🦄🧀☂️✝️✡️☯️";

    NSLog(@"emo_containsEmoji = %@",@([ios91 emo_containsEmoji]));
    NSLog(@"emo_containsEmoji = %@",@([abc emo_containsEmoji]));
    NSLog(@"emo_containsEmoji = %@",@([weird emo_containsEmoji]));
    NSLog(@"emo_containsEmoji = %@",@([ios91New emo_containsEmoji]));
    
    NSLog(@"emo_emojiCount = %@",@([ios91 emo_emojiCount]));
    NSLog(@"emo_emojiCount = %@",@([abc emo_emojiCount]));
    NSLog(@"emo_emojiCount = %@",@([weird emo_emojiCount]));
    NSLog(@"emo_emojiCount = %@",@([ios91New emo_emojiCount]));
    
    NSLog(@"emo_emojiRanges = %@",[ios91 emo_emojiRanges]);
    NSLog(@"emo_emojiRanges = %@",[abc emo_emojiRanges]);
    NSLog(@"emo_emojiRanges = %@",[weird emo_emojiRanges]);
    NSLog(@"emo_emojiRanges = %@",[ios91New emo_emojiRanges]);
    
    NSLog(@"emo_isPureEmojiString = %@",@([ios91 emo_isPureEmojiString]));
    NSLog(@"emo_isPureEmojiString = %@",@([abc emo_isPureEmojiString]));
    NSLog(@"emo_isPureEmojiString = %@",@([weird emo_isPureEmojiString]));
    NSLog(@"emo_isPureEmojiString = %@",@([ios91New emo_isPureEmojiString]));
}

@end
